<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Yubico Authenticator for Desktop and imports it into Intune.</string>
    <key>Identifier</key>
    <string>com.github.almenscorner.intune.yubioath-desktop</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>yubioath-desktop</string>
        <key>description</key>
        <string>Application for generating Open Authentication (OATH) time-based TOTP and event-based HOTP one-time password codes, with the help of a YubiKey that protects the shared secrets.</string>
        <key>developer</key>
        <string>Yubico</string>
        <key>display_name</key>
        <string>Yubico Authenticator</string>
        <key>categories</key>
        <array>
            <string>Productivity</string>
        </array>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>ParentRecipe</key>
    <string>com.github.n8felton.download.yubioath-desktop</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/downloads/yubioath-desktop.pkg</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%destination_path%/com.yubico.yubioath.pkg/Payload</string>
                <key>destination_path</key>
                <string>%destination_path%</string>
            </dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>info_path</key>
                <string>%destination_path%/Yubico Authenticator.app/Contents/Info.plist</string>
                <key>plist_keys</key>
                <dict>
                    <key>CFBundleShortVersionString</key>
                    <string>version</string>
                    <key>CFBundleIdentifier</key>
                    <string>bundleID</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PlistReader</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%destination_path%/Yubico Authenticator.app</string>
                <key>name</key>
                <string>%NAME%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppIconGetter</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>app_file</key>
                <string>%flat_pkg_path%</string>
                <key>displayname</key>
                <string>%display_name%</string>
                <key>description</key>
                <string>%description%</string>
                <key>publisher</key>
                <string>%developer%</string>
                <key>version</key>
                <string>%version%</string>
                <key>bundleVersion</key>
                <string>%version%</string>
                <key>bundleId</key>
                <string>%bundleID%</string>
                <key>icon</key>
                <string>%icon_file_path%</string>
            </dict>
            <key>Processor</key>
            <string>com.github.almenscorner.intune-upload.processors/IntuneAppUploader</string>
        </dict>
    </array>
</dict>
</plist>